# GetLightDistribution Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightType..::..GetLightDistribution Method
LightType Class See Also
---
Return a copy of an object derived from LightDistribution
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LightDistribution GetLightDistribution()
```

Visual Basic
---
```text
Public Function GetLightDistribution As LightDistribution
```

Visual C++
---
```text
public:
LightDistribution^ GetLightDistribution()
```

# See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace